ViewCubeOptionsPage.m_bEnableShowCompass
Defines whether to enable the ShowCompass Option
It is disabled when 1) No Active Document 2) Active Document is a Family Document 3) isaTransactionPending

ViewCubeOptionsPage.m_bShowCompass
Defines whether to show the compass with the ViewCube

ViewCubeOptionsPage.m_bShowInActiveViewOnly
ViewCube Show in Active View (TRUE, 1) or All Views (FALSE, 1)

ViewCubeOptionsPage.m_bKeepSceneRightSideUp
Defines whether to keep the scene upright or not (when clicking on the ViewCube)

ViewCubeOptionsPage.m_bAnimatedTransitions
Defines whether to use animated transitions when switching views or not.

ViewCubeOptionsPage.m_bFitToViewOnViewChange
Defines whether to fit the object to the view when clicking on the ViewCube.

ViewCubeOptionsPage.m_bSnapToClosestView
Defines whether to set the view orbit direction to the closest of the 26
fixed ViewCube part directions or not (during the drag operation).

ViewCubeOptionsPage.m_nScreenSize
ViewCube size identifier.
Can take constant values defined by the AutoCam::ViewCubeParameters::Size enumeration.

ViewCubeOptionsPage.m_nInactiveOpacity
ViewCube opacity level (in range [0,1]) when the cursor is away from
the ViewCube’s rendering area.

ViewCubeOptionsPage.m_nScreenPosition
ViewCube's position on the screen.
Can take constant values defined by the AutoCam::ViewCubeParameters::Location enumeration.

ViewCubeOptionsPage.m_bShowViewCube
Defines whether to show ViewCube or not.